#!/usr/bin/perl
my @preps = (
"в","за","без","ввиду","вдоль","вместо","вне","внутри","внутрь","возле","впереди","вследствие","вокруг","для","до","из","из-за","из-под","кроме","между",
"мимо","напротив","насчет","около","от","ото","относительно","помимо","после","посреди","посредством","подле","позади","после","против","путём","ради","с",
"со","сверх","свыше","среди","у","благодаря","вопреки","к","ко","по","в","во","за","на","о","по","под","про","сквозь","через","за","между","над","надо","перед",
"передо","под","подо","с","со","в","во","на","о","об","по","при",
"В","За","Без","Ввиду","Вдоль","Вместо","Вне","Внутри","Внутрь","Возле","Впереди","Вследствие","Вокруг","Для","До","Из","Из-за","Из-под","Кроме","Между",
"Мимо","Напротив","Насчет","Около","От","Ото","Относительно","Помимо","После","Посреди","Посредством","Подле","Позади","После","Против","Путём","Ради","С",
"Со","Сверх","Свыше","Среди","У","Благодаря","Вопреки","К","Ко","По","В","Во","За","На","О","По","Под","Про","Сквозь","Через","За","Между","Над","Надо","Перед",
"Передо","Под","Подо","С","Со","В","Во","На","О","Об","По","При"
);

my @conj = (
"а","благо","буде","будто","вдобавок","да","дабы","даже","едва","ежели","если","зато","зачем","и","ибо","или","кабы","как","как-то","когда","коли","либо",
"лишь","нежели","но","однако","особенно","оттого","отчего","пока","покамест","покуда","поскольку","потому","почему","притом","причем","пускай","пусть","раз",
"словно","также","тоже","так","только","точно","хотя","чем","что","чтоб","чтобы",
"\\ie"
);

my @preparts = (
"ни", "не", "как", "я", "ты", "мы", "вы", "он", "она", "они", "оно","Ни", "Не", "Как", "Я", "Ты", "Мы", "Вы", "Он", "Она", "Они", "Оно"
);

my @postparts = (
"же", "ж", "же", "б", "бы", "ли", "ль", "\"---"
);

my @digits = ("0", "1", "2", "3", "4", "5", "6", "7", "8", "9");

my @pre = (@preparts, @conj, @preps);
my @Pre = @pre;

my $alphabet = "йцукенгшщзхъфывапролджэячсмитьбю";
my $Alphabet = "ЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМИТЬБЮ";

my $preregex = join("|", (map quotemeta, @pre));
my $postregex = join("|", (map quotemeta, @postparts));

while (<>) {
    $_ =~ s/—/\"---/g;
#    $_ =~ s/«/<</g;
#    $_ =~ s/»/>>/g;
    $_ =~ s/(^|\r\n|\r|\n)($preregex) /$1$2~/g;
    $_ =~ s/([^$alphabet$Alphabet]($preregex)) /$1~/g;
    $_ =~ s/ (($postregex)[^$alphabet$Alphabet])/~$1/g;
    print $_;
}
