my @preps = (
"в",
"за",
"без",
"ввиду",
"вдоль",
"вместо",
"вне",
"внутри",
"внутрь",
"возле",
"впереди",
"вследствие",
"вокруг",
"дл€",
"до",
"из",
"из-за",
"из-под",
"кроме",
"между",
"мимо",
"напротив",
"насчет",
"около",
"от",
"ото",
"относительно",
"помимо",
"после",
"посреди",
"посредством",
"подле",
"позади",
"после",
"против",
"путЄм",
"ради",
"с",
"со",
"сверх",
"свыше",
"среди",
"у",
"благодар€",
"вопреки",
"к",
"ко",
"по",
"в",
"во",
"за",
"на",
"о",
"по",
"под",
"про",
"c",
"сквозь",
"через",
"за",
"между",
"над",
"надо",
"перед",
"передо",
"под",
"подо",
"с",
"со",
"в",
"во",
"на",
"о",
"об",
"по",
"при",
);

my @conj = (
"а",
"благо",
"буде",
"будто",
"вдобавок",
"да",
"дабы",
"даже",
"едва",
"ежели",
"если",
"зато",
"зачем",
"и",
"ибо",
"или",
"кабы",
"как",
"как-то",
"когда",
"коли",
"либо",
"лишь",
"нежели",
"но",
"однако",
"особенно",
"оттого",
"отчего",
"пока",
"покамест",
"покуда",
"поскольку",
"потому",
"почему",
"притом",
"причем",
"пускай",
"пусть",
"раз",
"словно",
"также",
"тоже",
"так",
"только",
"точно",
"хот€",
"чем",
"что",
"чтоб",
"чтобы",
"\\ie"
);

my @preparts = (
"ни", "не", "как", "€", "ты", "мы", "вы", "он", "она", "они", "оно"
);

my @postparts = (
"же", "ж", "же", "б", "бы", "ли", "ль", "\"---"
);

my @digits = ("0", "1", "2", "3", "4", "5", "6", "7", "8", "9");

my @pre = (@preparts, @conj, @preps);
my @Pre = @pre;

my $alphabet = "йцукенгшщзхъфывапролджэ€чсмитьбю";
my $Alphabet = "…÷” ≈Ќ√Ўў«’Џ‘џ¬јѕ–ќЋƒ∆Ёя„—ћ»“№Ѕё";

foreach $word (@Pre) {
    $word =~ m/^([$alphabet])(.*)/;
    $word = substr($Alphabet, index($alphabet, $1), 1).$2;
}

my $preregex = join("|", (map quotemeta, (@pre, @Pre)));
my $postregex = join("|", (map quotemeta, @postparts));

while (<>) {
    $_ =~ s/Ч/\"---/g;
    $_ =~ s/Ђ/<</g;
    $_ =~ s/ї/>>/g;
    $_ =~ s/^($preregex) /$1~/g;
    $_ =~ s/([^$alphabet$Alphabet]($preregex)) /$1~/g;
    $_ =~ s/ (($postregex)[^$alphabet$Alphabet])/~$1/g;
    print $_;
}
